УТ_для_edt/src/InformationRegisters/смартИсторияАвтоматизированногоРасчетаНеликвидов/смартИсторияАвтоматизированногоРасчетаНеликвидов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартИсторияАвтоматизированногоРасчетаНеликвидов</name>
  <comment>//++ смарт:КМД #3_2 501 13.06.2021</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.смартОборудованиеКлиентов</types>
    </type>
  </resources>
  <resources>
    <name>СреднийТоварныйЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Товарооборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОборачиваемостьДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВключенВНеликвидыS</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВключенВНеликвидыSПлюс</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИзмененоВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Catalogs/ХарактеристикиНоменклатуры/ХарактеристикиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХарактеристикиНоменклатуры</name>
  <owners>Catalog.ВидыНоменклатуры</owners>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Принципал</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>смартСрокГарантии</name>
    <comment>//++ #1944 смарт: Мосолов 26.07.2024 // Реализовать механизм предложения доп гарантии при покупке оборудования.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/смартАвтоматизированныйРасчетНеликвидовСервер/Module.bsl
//++ смарт:КМД #3_2 501 12.06.2021

Функция ПолучитьСтруктуруНастройки() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Структура = Новый Структура;
	Структура.Вставить("ГруппаНоменклатурыНеликвидыБрак", Справочники.смартПредопределенныеЗначения.ГруппаНоменклатурыНеликвидыБрак.Значение);
	Структура.Вставить("СегментSОборачиваемость", Справочники.смартПредопределенныеЗначения.СегментSОборачиваемость.Значение);
	Структура.Вставить("СегментSПлюсОборачиваемость", Справочники.смартПредопределенныеЗначения.СегментSПлюсОборачиваемость.Значение);
	
	Возврат Структура;
КонецФункции

Процедура ДобавитьЗаписьВРегистр_смартИсторияАвтоматизированногоРасчетаНеликвидов(Период, Номенклатура, Оборудование, СреднийТоварныйЗапас, Товарооборот,
	ОборачиваемостьДней, ВключенВНеликвидыS, ВключенВНеликвидыSПлюс, ИзмененоВручную) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МЗ = РегистрыСведений.смартИсторияАвтоматизированногоРасчетаНеликвидов.СоздатьМенеджерЗаписи();
	
	МЗ.Период = Период;
	МЗ.Номенклатура = Номенклатура;
	
	МЗ.Прочитать();
	
	МЗ.Период = Период;
	МЗ.Номенклатура = Номенклатура;
	МЗ.Оборудование = Оборудование;
	МЗ.СреднийТоварныйЗапас = СреднийТоварныйЗапас;
	МЗ.Товарооборот = Товарооборот;
	МЗ.ОборачиваемостьДней = ОборачиваемостьДней;
	МЗ.ВключенВНеликвидыS = ВключенВНеликвидыS;
	МЗ.ВключенВНеликвидыSПлюс = ВключенВНеликвидыSПлюс;
	МЗ.ИзмененоВручную = ИзмененоВручную;
	
	МЗ.Записать(Истина);
	
КонецПроцедуры

Процедура ВключитьНоменклатуруВСегментНеликвидов(Сегмент, Номенклатура) Экспорт
	
	//проверим, ведется ли учет по характеристикам
	ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ВидНоменклатуры");
	ИспользоватьХарактеристики = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ИспользоватьХарактеристики");
	
	Если ИспользоватьХарактеристики = Истина тогда
		//найдем все характеристки и добавим в сегмент
		МассивХарактеристик = НайтиМассивХарактеристикНоменклатуры(Номенклатура, ВидНоменклатуры);
		
		Если МассивХарактеристик.Количество() = 0 тогда
			ДобавитьНоменклатуруВСегмент(Сегмент, Номенклатура);
		Иначе
			Для каждого Характеристика из МассивХарактеристик цикл
				ДобавитьНоменклатуруВСегмент(Сегмент, Номенклатура, Характеристика);
			КонецЦикла;
		КонецЕсли;
	Иначе
		//добавляем в сегмент номенклутуру без характеристики
		ДобавитьНоменклатуруВСегмент(Сегмент, Номенклатура);
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиМассивХарактеристикНоменклатуры(Номенклатура, ВидНоменклатуры)
	МассивХарактеристик = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика
	               |ПОМЕСТИТЬ ВТ_БезГруппировки
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	               |ГДЕ
	               |	ХарактеристикиНоменклатуры.ПометкаУдаления = ЛОЖЬ
	               |	И ХарактеристикиНоменклатуры.Владелец = &Номенклатура
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ХарактеристикиНоменклатуры.Ссылка
	               |ИЗ
	               |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	               |ГДЕ
	               |	ХарактеристикиНоменклатуры.ПометкаУдаления = ЛОЖЬ
	               |	И ХарактеристикиНоменклатуры.Владелец = &ВидНоменклатуры
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_БезГруппировки.Характеристика КАК Характеристика
	               |ИЗ
	               |	ВТ_БезГруппировки КАК ВТ_БезГруппировки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_БезГруппировки.Характеристика";
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() цикл
			Если ЗначениеЗаполнено(Выборка.Характеристика) тогда
				МассивХарактеристик.Добавить(Выборка.Характеристика);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивХарактеристик;
КонецФункции

//истина, если необходимо было исключить из неликвидов
Функция ИсключитьНоменклатуруИзСегментовНеликвидов(Номенклатура, Сегмент1, Сегмент2) Экспорт
	//получим ТЗ по номенклатуре, собранную по сегментам
	ТЗ = ПолучитьТаблицуПоНоменклатуреПоСегментам(Номенклатура, Сегмент1, Сегмент2);
	
	Если ТЗ.Количество() = 0 тогда
		Возврат Ложь;
	Иначе
		
		Для каждого стр из ТЗ цикл
			УдалитьНоменклатуруИзСегмента(стр.Сегмент, стр.Номенклатура, стр.Характеристика);
		КонецЦикла;
		
		Возврат Истина;
	КонецЕсли;
КонецФункции

Функция ПолучитьТаблицуПоНоменклатуреПоСегментам(Номенклатура, Сегмент1, Сегмент2) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Сегмент1", Сегмент1);
	Запрос.УстановитьПараметр("Сегмент2", Сегмент2);
	Запрос.Текст = "ВЫБРАТЬ
	               |	НоменклатураСегмента.Сегмент КАК Сегмент,
	               |	НоменклатураСегмента.Номенклатура КАК Номенклатура,
	               |	НоменклатураСегмента.Характеристика КАК Характеристика
	               |ИЗ
	               |	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	               |ГДЕ
	               |	(НоменклатураСегмента.Сегмент = &Сегмент1
	               |			ИЛИ НоменклатураСегмента.Сегмент = &Сегмент2)
	               |	И НоменклатураСегмента.Номенклатура = &Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НоменклатураСегмента.Сегмент,
	               |	НоменклатураСегмента.Номенклатура,
	               |	НоменклатураСегмента.Характеристика";
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьАктуальнуюИнформациюОНеликвидах(Номенклатура) Экспорт
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура", Номенклатура);
	Структура.Вставить("Оборудование", Справочники.смартОборудованиеКлиентов.ПустаяСсылка());
	Структура.Вставить("СреднийТоварныйЗапас", 0);
	Структура.Вставить("Товарооборот", 0);
	Структура.Вставить("ОборачиваемостьДней", 0);
	Структура.Вставить("ВключенВНеликвидыS", Ложь);
	Структура.Вставить("ВключенВНеликвидыSПлюс", Ложь);
	Структура.Вставить("ИзмененоВручную", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.Текст = "ВЫБРАТЬ
	               |	смартИсторияАвтоматизированногоРасчетаНеликвидовСрезПоследних.Период КАК Период,
	               |	смартИсторияАвтоматизированногоРасчетаНеликвидовСрезПоследних.Номенклатура КАК Номенклатура,
	               |	смартИсторияАвтоматизированногоРасчетаНеликвидовСрезПоследних.Оборудование КАК Оборудование,
	               |	смартИсторияАвтоматизированногоРасчетаНеликвидовСрезПоследних.СреднийТоварныйЗапас КАК СреднийТоварныйЗапас,
	               |	смартИсторияАвтоматизированногоРасчетаНеликвидовСрезПоследних.Товарооборот КАК Товарооборот,
	               |	смартИсторияАвтоматизированногоРасчетаНеликвидовСрезПоследних.ОборачиваемостьДней КАК ОборачиваемостьДней,
	               |	смартИсторияАвтоматизированногоРасчетаНеликвидовСрезПоследних.ВключенВНеликвидыS КАК ВключенВНеликвидыS,
	               |	смартИсторияАвтоматизированногоРасчетаНеликвидовСрезПоследних.ВключенВНеликвидыSПлюс КАК ВключенВНеликвидыSПлюс,
	               |	смартИсторияАвтоматизированногоРасчетаНеликвидовСрезПоследних.ИзмененоВручную КАК ИзмененоВручную
	               |ИЗ
	               |	РегистрСведений.смартИсторияАвтоматизированногоРасчетаНеликвидов.СрезПоследних(, Номенклатура = &Номенклатура) КАК смартИсторияАвтоматизированногоРасчетаНеликвидовСрезПоследних";
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		ЗаполнитьЗначенияСвойств(Структура, Выборка);
	КонецЕсли;
	
	Возврат Структура;
КонецФункции

// Добавляет пару номенклатура\характеристика  в сегмент номенклатуры.
//
// Параметры:
//  Сегмент        - СправочникСсылка.СегментыНоменклатуры - сегмент, в который добавляется номенклатуры.
//  Номенклатура   - СправочникСсылка.Номенклатура - добавляемая в сегмент номенклатура.
//  Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - добавляемая в сегмент характеристика номенклатуры.
//
Процедура ДобавитьНоменклатуруВСегмент(Сегмент, Номенклатура, Характеристика = Неопределено) Экспорт

	Запись = РегистрыСведений.НоменклатураСегмента.СоздатьМенеджерЗаписи();
	Запись.Сегмент = Сегмент;
	Запись.Номенклатура = Номенклатура;
	Если Характеристика <> Неопределено Тогда
		Запись.Характеристика = Характеристика;
	КонецЕсли;
	
	Запись.Записать();

КонецПроцедуры 

// Удаляет пару номенклатура\характеристика из сегмента номенклатуры.
//
// Параметры:
//  Сегмент        - СправочникСсылка.СегментыНоменклатуры - сегмент, из которого удаляется номенклатуры.
//  Номенклатура   - СправочникСсылка.Номенклатура - удаляемая из сегмента номенклатура.
//  Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - удаляемая из сегмента номенклатуры.
//
Процедура УдалитьНоменклатуруИзСегмента(Сегмент, Номенклатура, Характеристика = Неопределено) Экспорт

	НаборЗаписей = РегистрыСведений.НоменклатураСегмента.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сегмент.Установить(Сегмент);
	НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
	Если Характеристика <> Неопределено Тогда
		НаборЗаписей.Отбор.Характеристика.Установить(Характеристика);
	КонецЕсли;
	НаборЗаписей.Записать();

КонецПроцедуры
